#! /usr/bin/env python
# -*- coding=utf-8 -*-

"""
Created on 2018-10-22
hq接口模块
@author: lkw
"""

import zmq

try:
    # 行情接口,bind不能用localhost
    contexts = zmq.Context()
    socket_plate = contexts.socket(zmq.REP)
    socket_plate.bind("tcp://*:5565")
except Exception as e:
    print('error:')
    print(e)
    socket_plate.close()
    contexts.term()

index_dicts = {'000001.SH': ['000010', '000002', '000003', '000004', '000005'],
         '000002.SH': ['000006', '000002', '000003', '000004', '000007'],
         '399107.SZ': ['000001', '000011', '000006', '000004', '000005'],
         '399105.SZ': ['000001', '000012', '000007', '000004', '000005'],
         '399005.SZ': ['000001', '000013', '000008', '000004', '000005'],
         '399006.SZ': ['000001', '000014', '000009', '000004', '000005'],
         'ah001': ['000001', '000015', '000010', '000004', '000005'],
         '000300.SH': ['000001', '000016', '000011', '000004', '000005'],
         '000016.SH': ['000001', '000002', '000003', '000004', '000005'],

         '000010.SH': ['000001', '000017', '000012', '000004', '000005'],
         '000009.SH': ['000006', '000018', '000013', '000004', '000007'],
         '399330.SZ': ['000001', '000019', '000014', '000004', '000005'],
         '399007.SZ': ['000001', '000010', '000015', '000004', '000005'],
         '399008.SZ': ['000001', '000011', '000016', '000004', '000005'],
         '399903.SZ': ['000001', '000007', '000006', '000004', '000005'],
         '000905.SH': ['000001', '000009', '000011', '000004', '000005'],
         }

dicts = {'index':index_dicts}


def plate():
    """
    板块模块，提供投资标的范围的相关数据
    """
    while True:
        # 接受板块的相关请求，返回板块的相关数据
        print(1)
        __plate_info = socket_plate.recv_pyobj()
        print(2)
        print('收到的：{}'.format(__plate_info))
        __result = set(dicts.get(__plate_info['indicator']).get(__plate_info['value']))
        socket_plate.send_pyobj(__result)
if __name__ == '__main__':
    plate()
